<a href="https://colab.research.google.com/github/arenas-franklin/bootcampDataEngineer/blob/main/analise_dados_pandas/Trabalhando_com_excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Trabalahndo com Planilhas do Excel**

In [1]:
# Importando a biblioteca
import pandas as pd

In [2]:
!git clone https://github.com/arenas-franklin/bootcampDataEngineer/

Cloning into 'bootcampDataEngineer'...
remote: Enumerating objects: 52, done.
remote: Counting objects: 100% (52/52), done.
remote: Compressing objects: 100% (49/49), done.
remote: Total 52 (delta 12), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (52/52), done.

In [3]:
#Leitura dos arquivos
df1 = pd.read_excel("/content/bootcampDataEngineer/analise_dados_pandas/datasets/Aracaju.xlsx")
df2 = pd.read_excel("/content/bootcampDataEngineer/analise_dados_pandas/datasets/Fortaleza.xlsx")
df3 = pd.read_excel("/content/bootcampDataEngineer/analise_dados_pandas/datasets/Natal.xlsx")
df4 = pd.read_excel("/content/bootcampDataEngineer/analise_dados_pandas/datasets/Recife.xlsx")
df5 = pd.read_excel("/content/bootcampDataEngineer/analise_dados_pandas/datasets/Salvador.xlsx")

In [4]:
# juntando todos os arquivos
df = pd.concat([df1, df2, df3, df4, df5])

In [5]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
#Exibindoas 5 ultimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
# amostra do conjunto de dados
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
171     Natal 2019-01-02  136.45    1035     3
237     Natal 2019-01-03   38.06    1036     3
123   Aracaju 2018-01-01  115.19    1523     6
191  Salvador 2019-01-02  173.59    1034     2
104     Natal 2019-01-02  188.79    1036     3

In [8]:
# verificando os tipos de dados de cada colunas
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:
# alteraddno o tipo de dados da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [10]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

## **Tratando valores Faltantes**

In [12]:
# consultando linhas com valores faltatnes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [24]:
#Substituindo os valores nulos pela média
df['Vendas'].fillna(df['Vendas'].mean(), inplace=True)

In [28]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [30]:
df['Vendas'].mean()

122.61180089485438

In [35]:
df['Vendas'].sample(15)

6       38.40
72     106.72
5       13.59
139    141.16
114     16.82
155    237.81
188    178.11
68     274.00
207     46.70
127     39.56
25     611.00
111      8.00
36      36.31
65       3.39
229     43.08
Name: Vendas, dtype: float64

In [36]:
# Substituição os valroes nulos por zero
df['Vendas'].fillna(0, inplace=True)

In [37]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [38]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [39]:
# Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

## Criando colunas novas

In [40]:
# Criandno a colunas de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [41]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [43]:
df['Receita/Vendas'] = df['Receita']/df["Vendas"]

In [44]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [45]:
# Retornando a maior receita
df["Receita"].max()

3544.0

In [46]:
# Retornando a menor receita
df["Receita"].min()

3.34

In [47]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [48]:
#nsmallest
df.nsmallest(3, 'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [49]:
# Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [50]:
# Ordenando o cinjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

## Trabalhando com datas

In [51]:
# Trabalhando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype('int64')

In [52]:
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [53]:
# transformando coluna de data em data
df["Data"] = pd.to_datetime(df['Data'])

In [56]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [58]:
# agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [59]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [62]:
df.sample(5)

        Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
33   Fortaleza 2019-01-01   19.56  ...    19.56             1.0       2019
87       Natal 2019-01-02  135.19  ...   270.38             2.0       2019
84       Natal 2019-01-02   22.99  ...    22.99             1.0       2019
15       Natal 2018-02-01  432.00  ...  1296.00             3.0       2018
230      Natal 2019-01-03  184.69  ...   184.69             1.0       2019

[5 rows x 8 columns]

In [63]:
# Extraindo o mês e o dia
df['mes_venda'], df['dia_venda'] = (df["Data"].dt.month, df["Data"].dt.day)

In [64]:
df.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
40    Aracaju 2018-01-01    6.99  ...      2018          1          1
91   Salvador 2019-01-01   17.74  ...      2019          1          1
6     Aracaju 2018-01-01   35.50  ...      2018          1          1
99      Natal 2019-01-02   40.38  ...      2019          1          2
225  Salvador 2019-01-02   36.23  ...      2019          1          2

[5 rows x 10 columns]

In [65]:
# Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [66]:
# calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [67]:
df.sample(5)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
41   Fortaleza 2019-02-13  191.29  ...         2         13        408 days
150   Salvador 2019-01-02   11.13  ...         1          2        366 days
16      Recife 2019-01-01   19.95  ...         1          1        365 days
115    Aracaju 2018-01-01   50.99  ...         1          1          0 days
58       Natal 2018-12-23  272.00  ...        12         23        356 days

[5 rows x 11 columns]

In [69]:
# Calculando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [71]:
df.sample(5)

       Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
236  Salvador 2019-01-03  126.29  ...         3        367 days                1
22      Natal 2018-06-21  621.00  ...        21        171 days                2
162     Natal 2019-01-02   23.08  ...         2        366 days                1
83    Aracaju 2018-01-01   14.44  ...         1          0 days                1
167     Natal 2019-01-02   36.42  ...         2        366 days                1

[5 rows x 12 columns]

In [73]:
# Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df['Data'].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [74]:
vendas_marco_19

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
108  Fortaleza 2019-03-02  152.89  ...         2        425 days                1
109  Fortaleza 2019-03-02   18.90  ...         2        425 days                1
110  Fortaleza 2019-03-02   51.98  ...         2        425 days                1
111  Fortaleza 2019-03-02    8.00  ...         2        425 days                1
112  Fortaleza 2019-03-02  133.59  ...         2        425 days                1
..         ...        ...     ...  ...       ...             ...              ...
137   Salvador 2019-03-02   51.66  ...         2        425 days                1
138   Salvador 2019-03-02  212.03  ...         2        425 days                1
139   Salvador 2019-03-02  169.01  ...         2        425 days                1
140   Salvador 2019-03-02   20.79  ...         2        425 days                1
141   Salvador 2019-03-02    9.08  ...         2        425 days                1

[121 rows x 12 columns]